package com.ruinap.infra.enums.alarm;

import lombok.AllArgsConstructor;

/**
 * 告警码枚举类
 *
 * @author qianye
 * @create 2025-02-26 20:49
 */
@AllArgsConstructor
public enum AlarmCodeEnum {
    /**
     * 地图数据不一致告警码
     */
    E10001(0, 3, 10001, "AGV地图数据不一致", -1),
    E10002(0, 3, 10002, "AGV离线", -1),
    E10003(0, 3, 10003, "AGV不在点位", -1),
    E10004(0, 3, 10004, "AGV脱轨", -1),
    E10005(0, 0, 10005, "AGV暂停", -1),
    E10006(0, 2, 10006, "AGV丢定位", -1),
    E10007(0, 2, 10007, "AGV急停", -1),
    E10008(0, 0, 10008, "AGV手动", -1),
    E10009(0, 3, 10009, "AGV报错", -1),

    E10010(0, 3, 10010, "AGV前避障无信号", -1),
    E10011(0, 1, 10011, "AGV前避障减速", -1),
    E10012(0, 1, 10012, "AGV前避障停车", -1),
    E10013(0, 3, 10013, "AGV左前避障无信号", -1),
    E10014(0, 1, 10014, "AGV左前避障减速", -1),
    E10015(0, 1, 10015, "AGV左前避障停车", -1),
    E10016(0, 3, 10016, "AGV右前避障无信号", -1),
    E10017(0, 1, 10017, "AGV右前避障减速", -1),
    E10018(0, 1, 10018, "AGV右前避障停车", -1),
    E10019(0, 3, 10019, "AGV后避障无信号", -1),
    E10020(0, 1, 10020, "AGV后避障减速", -1),
    E10021(0, 1, 10021, "AGV后避障停车", -1),
    E10022(0, 3, 10022, "AGV左后避障无信号", -1),
    E10023(0, 1, 10023, "AGV左后避障减速", -1),
    E10024(0, 1, 10024, "AGV左后避障停车", -1),
    E10025(0, 3, 10025, "AGV右后避障无信号", -1),
    E10026(0, 1, 10026, "AGV右后避障减速", -1),
    E10027(0, 1, 10027, "AGV右后避障停车", -1),

    E10028(0, 3, 10028, "AGV前防撞条无信号", -1),
    E10029(0, 1, 10029, "AGV前防撞条触发", -1),
    E10030(0, 3, 10030, "AGV后防撞条无信号", -1),
    E10031(0, 1, 10031, "AGV后防撞条触发", -1),
    E10032(0, 3, 10032, "AGV左防撞条无信号", -1),
    E10033(0, 1, 10033, "AGV左防撞条触发", -1),
    E10034(0, 3, 10034, "AGV右防撞条无信号", -1),
    E10035(0, 1, 10035, "AGV右防撞条触发", -1),
    E10036(0, 1, 10036, "MOVE指令异常", -1),

    E11001(1, 3, 11001, "系统获取不到点位", -1),

    E12001(2, 1, 12001, "输送线不允许取货", -1),
    E12002(2, 1, 12002, "输送线不允许卸货", -1),

    E12003(1, 1, 12003, "客户端关闭连接", -1),
    E12004(1, 1, 12004, "服务端关闭连接", -1),
    ;

    /**
     * 告警类型 0AGV 1系统 2设备 3其他
     */
    public final Integer type;
    /**
     * 告警级别  0通知 1警告 2异常 3错误
     */
    public final Integer level;
    /**
     * 告警代码
     */
    public final Integer code;
    /**
     * 告警信息
     */
    public final String msg;
    /**
     * 是否上报 -1不上报 0未上报 1已上报
     */
    public final Integer report;

    /**
     * 根据告警码获取枚举实例的方法
     *
     * @param code 告警码
     * @return 枚举实例，如果找不到对应的告警码，返回null
     */
    public static AlarmCodeEnum fromEnum(Integer code) {
        for (AlarmCodeEnum temp : values()) {
            if (temp.code.equals(code)) {
                return temp;
            }
        }
        return null;
    }
}
